tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-19 Tue 15:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some Tips</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nan Jun Jie" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Some Tips</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfa69e5d">Qemu</a></li>
<li><a href="#org96a1fed">Ncat</a>
<ul>
<li><a href="#orga752ff4">Install</a></li>
<li><a href="#orgc0baa92">Transfer Files</a>
<ul>
<li><a href="#orgd65cc69">Single File</a></li>
<li><a href="#orgca7a996">Multiple Files</a></li>
</ul>
</li>
<li><a href="#orgaa38b00">Proxy The World</a>
<ul>
<li><a href="#orgcda8b93">As A Http Proxy Server</a></li>
<li><a href="#org0977ad8">Proxy Over Ssh</a></li>
<li><a href="#org50498e3">Proxy Ssh</a></li>
<li><a href="#orge932d33">Proxy Ansible</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa69e5d" class="outline-2">
<h2 id="orgfa69e5d">Qemu</h2>
<div class="outline-text-2" id="text-orgfa69e5d">
<ol class="org-ol">
<li><p>
which nic models qemu supports?
</p>
<div class="org-src-container">
<pre class="src src-sh">qemu-system-x86_64 -net nic,<span class="org-variable-name">model</span>=?
<span class="org-comment-delimiter">#</span><span class="org-comment">=&gt;</span>
qemu: Supported NIC models: ne2k_pci,i82551,i82557b,i82559er,rtl8139,e1000,pcnet,virtio
</pre>
</div></li>
<li>Quit qemu `C-A C`.</li>
</ol>
</div>
</div>

<div id="outline-container-org96a1fed" class="outline-2">
<h2 id="org96a1fed">Ncat</h2>
<div class="outline-text-2" id="text-org96a1fed">
<p>
<a href="https://nmap.org/ncat/">Ncat</a> is a general-purpose command-line tool for reading, writing,
redirecting, and encrypting data across a network. It is along with
<a href="https://nmap.org/">nmap</a>, but not so famous.
</p>
</div>

<div id="outline-container-orga752ff4" class="outline-3">
<h3 id="orga752ff4">Install</h3>
<div class="outline-text-3" id="text-orga752ff4">
<p>
To install ncat just install nmap, Ubuntu:
</p>
<pre class="example">
apt-get install nmap
</pre>

<p>
Mac:
</p>

<pre class="example">
brew install nmap
</pre>

<p>
Here some tips from me.
</p>
</div>
</div>

<div id="outline-container-orgc0baa92" class="outline-3">
<h3 id="orgc0baa92">Transfer Files</h3>
<div class="outline-text-3" id="text-orgc0baa92">
</div>
<div id="outline-container-orgd65cc69" class="outline-4">
<h4 id="orgd65cc69">Single File</h4>
<div class="outline-text-4" id="text-orgd65cc69">
<p>
Transfer single file:
</p>

<pre class="example">
# on machine A
ncat -p 80 -l --send-only &lt; file
# on machine B
ncat &lt;machine A ip&gt; 80 --recv-only &gt; file
</pre>
</div>
</div>

<div id="outline-container-orgca7a996" class="outline-4">
<h4 id="orgca7a996">Multiple Files</h4>
<div class="outline-text-4" id="text-orgca7a996">
<p>
Transfer multiple files:
</p>

<pre class="example">
# on machine A
for file in *.deb; do
    echo $file | ncat -p 80 -l --send-only
    ncat -p 80 -l --send-only &lt; $file
done
# on machine B
while true; do
    file=$(ncat &lt;machine A ip&gt; 80 --recv-only) || break
    echo $file
    ncat &lt;machine A ip&gt; 80 --recv-only &gt; $file
done
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa38b00" class="outline-3">
<h3 id="orgaa38b00">Proxy The World</h3>
<div class="outline-text-3" id="text-orgaa38b00">
<p>
Ncat can act as a http proxy server, which 
</p>
</div>

<div id="outline-container-orgcda8b93" class="outline-4">
<h4 id="orgcda8b93">As A Http Proxy Server</h4>
<div class="outline-text-4" id="text-orgcda8b93">
<p>
Run:
</p>

<pre class="example">
ncat -l -p 8888 --proxy-type http --allow 127.0.0.1
</pre>

<p>
Test it(on the machine running ncat):
</p>

<pre class="example">
export https_proxy=http://127.0.0.1:8888
curl https://www.google.com
</pre>
</div>
</div>

<div id="outline-container-org0977ad8" class="outline-4">
<h4 id="org0977ad8">Proxy Over Ssh</h4>
<div class="outline-text-4" id="text-org0977ad8">
<p>
Let's say you are living in China, right behind the GFW. You have
Ncat in http proxy mode on a machine outside. Now you can jump over
the wall via ssh:
</p>

<pre class="example">
ssh -L 127.0.0.1:8888:127.0.0.1:8888 &lt;your machine outside the wall&gt;
</pre>

<p>
Test it again(on the machine running <code>ssh -L</code>):
</p>

<pre class="example">
export http_proxy=http://127.0.0.1:8888
curl http://www.google.com
</pre>

<p>
Http request will go through your local port 8888, encrypted and
jump over the wall, go to your target machine local port 8888, via
ncat to access the world. It's safe, simple, stable and fast.
</p>
</div>
</div>

<div id="outline-container-org50498e3" class="outline-4">
<h4 id="org50498e3">Proxy Ssh</h4>
<div class="outline-text-4" id="text-org50498e3">
<p>
Ncat http proxy mode support <code>CONNECT</code> method also. So it can be
used as a ssh proxy:
</p>

<pre class="example">
ssh -o "ProxyCommand=ncat --proxy 127.0.0.1:8888 %h %p" user@host
</pre>

<p>
Ssh traffic will go to your local port 8888, ssh will forward it to
your jumpbox, which ncat is running there, to visit all the machines
running behind the jumpbox. In this way, you can keep your ssh keys
in your local, no need to copy anywhere in order to access your
machines.
</p>

<p>
You can put it to your <code>~/.ssh/config</code>:
</p>

<pre class="example">
Host: host
Hostname: host
ProxyCommand: ncat --proxy 127.0.0.1:8888 %h %p
</pre>
</div>
</div>

<div id="outline-container-orge932d33" class="outline-4">
<h4 id="orge932d33">Proxy Ansible</h4>
<div class="outline-text-4" id="text-orge932d33">
<p>
You can run ansible with below configuration in your inventory:
</p>

<pre class="example">
[all:vars]
ansible_ssh_common_args='-o ProxyCommand="ncat --proxy 127.0.0.1:8888 %h %p"'
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
